{
    "Math Rush": {
        "fr": "Ruée de Mathématiques",
        "es":"Carrera de matemáticas",
        "chi":"数学冲冲冲",
        "hi":"गणित की भीड़" 
    },
    "Random Math": {
    	"fr": "Maths aléatoires",
    	"es": "Matemáticas al azar",
    	"chi":"随机数学",
    	"hi":"रैंडम गणित"
    },
    "Game is too easy?":{
    	"fr": "Le jeu est trop facile?",
    	"es": "El juego es muy facil?",
    	"chi":"游戏太容易了?",
    	"hi":"खेल बहुत आसान है\u003f"
    },
    "The way to go to learn addition, subtraction, multiplication, and division!":{
    	"fr":"La manière de faire pour apprendre l'addition, la soustraction, la multiplication, et la division",
    	"es":"¡El camino a seguir para aprender suma, resta, multiplicación y división!",
    	"chi":"学习加法，减法，乘法和除法的方法！",
    	"hi":"इसके अलावा\u002c घटाव\u002c गुणा\u002c और विभाजन सीखने के लिए रास्ता\u0021"
    },
    "Play Now":{
    	"fr": "Jouez maintenant",
    	"es": "Juega ahora",
    	"chi":"现在播放",
    	"hi":"अब खेलते हैं"
    },
    "About Me/ Contact Me":{
    	"fr":"À propos de moi / Contactez moi",
    	"es":"Quién soy / Contáctame",
    	"chi":"关于我 / 联络我",
    	"hi":"मेरे बारे में / मुझसे संपर्क करो"
    },
    "Practice Mode: You can take all the time you want, and if you get the answer wrong, a step-by-step answer is given.":{
    	"fr": "Mode pratique: Vous pouvez prendre tout le temps que vous voulez. Si votre réponse est mauvaise, les étapes pour arriver à la solution seront montrées.",
    	"es": "Modo de práctica: Puede tomarse todo el tiempo que desee y, si la respuesta es incorrecta, se proporciona una respuesta paso a paso.",
    	"chi":"练习模式：您可以随时学习，如果答案错误，则会给出逐步的答案。",
    	"hi":"अभ्यास मोड\u003a आप हर समय ले सकते हैं\u002c और यदि आपको उत्तर गलत मिलता है\u002c तो चरण\u002dदर\u002dचरण उत्तर दिया जाता है।"
    },
    "Exam Mode: You can take all the time you want, but you will not get a second chance if your answer is wrong.":{
    	"fr": "Mode examen: Vous pouvez prendre tout le temps que vous voulez, mais vous n'aurez pas de deuxième chance si votre réponse est mauvaise.",
    	"es": "Modo de examen: Puede tomarse todo el tiempo que desee, pero no tendrá una segunda oportunidad si su respuesta es incorrecta.",
    	"chi":"考试模式：您可以随时学习，但如果答案错误，您将无法获得第二次机会。",
    	"hi":"परीक्षा मोड\u003a आप हर समय ले सकते हैं\u002c लेकिन आपको दूसरा मौका नहीं मिलेगा यदि आपका उत्तर गलत है"
    },
    "Timed Exam Mode: You have limited time (to your choosing), and you do not get a second chance.":{
    	"fr": "Mode examen minuté: Votre temps est limité (au choix), et vous n'aurez pas de deuxième chance.",
    	"es": "Modo de examen cronometrado: Tiene un tiempo limitado (a su elección) y no tiene una segunda oportunidad.",
    	"chi":"定时考试模式：你的时间有限（根据你的选择），你没有第二次机会。",
    	"hi":"समयबद्ध परीक्षा मोड\u003a आपके पास सीमित समय \u0028आपके चुनने के लिए\u0029 है\u002c और आपको दूसरा मौका नहीं मिलता है।"
    },
    "Addition":{
    	"fr":"Addition",
    	"es": "Adición",
    	"chi":"加成",
    	"hi":"इसके अलावा"
    },
    "Subtraction":{
    	"fr":"Soustraction",
    	"es":"Sustracción",
    	"chi":"减法",
    	"hi":"घटाव"
    },
    "Multiplication":{
    	"fr":"Multiplication",
    	"es":"Multiplicación",
    	"chi":"乘法",
    	"hi":"गुणन"
    },
    "Division":{
    	"fr":"Division",
    	"es":"División",
    	"chi":"师",
    	"hi":"विभाजन"
    },
    "Return to Home Page":{
    	"fr":"Retour à l'accueil",
    	"es": "Regresar a la página principal",
    	"chi":"回到主页",
    	"hi":"होमपेज पर वापस आएं"
    },
    "Exam":{
    	"fr":"Examen",
    	"es":"Examen",
    	"chi":"考试",
    	"hi":"परीक्षा"
    },
    "Practice":{
    	"fr":"Pratique",
    	"es":"Práctica",
    	"chi":"实践",
    	"hi":"अभ्यास"
    },
    "Timed Exam":{
    	"fr":"Examen minuté",
    	"es":"Examen cronometrado",
    	"chi":"定时考试",
    	"hi":"समय पर परीक्षा"
    },
    "Submit":{
    	"fr":"Valider",
    	"es":"Enviar",
    	"chi":"提交",
    	"hi":"जमा करें"
    },
    "Sorry, Wrong Answer.":{
    	"fr": "Désolé, mauvaise réponse.",
    	"es":"Lo siento, respuesta incorrecta.",
    	"chi":"对不起，错误的答案。",
    	"hi":"क्षमा करें\u002c गलत उत्तर"
    },
    "Nice Job!":{
    	"fr": "Bon travail!",
    	"es":"Buen trabajo!",
    	"chi":"不错的工作！",
    	"hi":"अच्छी नौकरी\u0021"
    },
    "Oops! Wrong answer.Look below for an explanation.":{
    	"fr": "Désolé! Mauvaise réponse. Regardez ci-dessous pour une explication.",
    	"es":"¡Uy! Respuesta incorrecta. Busque a continuación una explicación.",
    	"chi":"哎呀！错误的答案。看下面的解释。",
    	"hi":"ऊप्स\u0021 गलत उत्तर। स्पष्टीकरण के लिए नीचे देखें।"
    },
    "Select the Time":{
    	"fr": "Choisissez le temps",
    	"es":"Selecciona la hora",
    	"chi":"选择时间",
    	"hi":"समय का चयन करें"
    },
    "Select the time in seconds you will have to answer one math question. Passed that time, no answers will be accepted and you will lose %n mark. (Value between %n and %n. Default: %n)":{
    	"fr": "Choisissez le temps en secondes que vous aurez pour répondre aux questions. Passé ce temps, vous perdrez %n point. (Valeur entre %n et %n. Par défaut: %n)",
    	"es":"Seleccione el tiempo en segundos que tendrá que responder a una pregunta de matemáticas. Transcurrido ese tiempo, no se aceptarán respuestas y perderá %n nota. (Valor entre %n y %n. Valor predeterminado: %n)",
    	"chi":"选择您必须回答一个数学问题的时间（以秒为单位）。通过那个时间，没有答案将被接受，你将失去%n标记。 （%n和%n之间的值。默认值：%n）",
    	"hi":"सेकंड में समय का चयन करें आपको एक गणित प्रश्न का उत्तर देना होगा। उस समय बीत गया\u002c कोई उत्तर स्वीकार नहीं किया जाएगा और आप\u0025 %n अंक खो देंगे \u0028%n और\u0025 %n के बीच मान। डिफ़ॉल्ट\u003a%n\u0029"
    },
    "Note: You do not need time to press on the input field, because it is automatically done for you. When you are done answering a question, just press Enter.":{
    	"fr": "PS: Vous n'avez pas besoin d'appuyer sur le champ de saisie de texte, parce qu'elle est automatiquement sélectionnée. Quand vous avez fini de répondre à la question, pesez sur Enter.",
    	"es":"Nota: no necesita tiempo para presionar en el campo de entrada, ya que se realiza automáticamente por usted. Cuando haya terminado de responder una pregunta, simplemente presione Enter.",
    	"chi":"注意：您无需时间按输入字段，因为它会自动为您完成。完成回答问题后，只需按Enter键即可。",
    	"hi":"नोट\u003a आपको इनपुट फ़ील्ड पर प्रेस करने के लिए समय की आवश्यकता नहीं है\u002c क्योंकि यह स्वचालित रूप से आपके लिए किया जाता है। जब आप किसी प्रश्न का उत्तर दे रहे हों\u002c तो बस \u0045\u006e\u0074\u0065\u0072 दबाएं।"
    },
    "Ready?":{
    	"fr": "Prêt?",
    	"es": "Listo?",
    	"chi":"准备\u003f",
    	"hi":"तैयार"
    },
    "FUN":{
    	"fr":"Amusant",
    	"es":"Divertido",
    	"chi":"开玩笑",
    	"hi":"मज़ा"
    },
    "EASY":{
    	"fr":"Facile",
    	"es":"Fácil",
    	"chi":"简单",
    	"hi":"आसान"
    },
    "EFFECTIVE":{
    	"fr":"Efficace",
    	"es":"Eficaz",
    	"chi":"有效",
    	"hi":"प्रभावी"
    },
    "You answered %n questions correctly.":{
    	"fr": "Vous avez répondu à %n questions correctement.",
    	"es": "Respondiste %n preguntas correctamente.",
    	"chi":"你回答了总共%n个问题。",
    	"hi":"आपने %n प्रश्नों का सही उत्तर दिया।"
    },
    "You answered a total of %n questions.":{
    	"fr": "Vous avez répondu à %n questions au total.",
    	"es": "Respondiste un total de %n preguntas.",
    	"chi": "你回答了总共%n个问题。",
    	"hi":"आपने कुल %n प्रश्नों के उत्तर दिए।"
    },
    "Result: %n%":{
    	"fr": "Résultat: %n%",
    	"es": "Resultado: %n%",
    	"chi":"结果： %n%",
    	"hi":"परिणाम\u003a %n%"
    },
    "AMAZING!":{
    	"fr": "IMPRESSIONNANT!",
    	"es": "INCREíBLE",
    	"chi":"惊人！",
    	"hi":"गजब का"
    },
    "Splendid!":{
    	"fr":"Splendide!",
    	"es":"Espléndido",
    	"chi":"灿烂！",
    	"hi":"शानदार"
    },
    "Could be better":{
    	"fr":"Pourrait être mieux",
    	"es": "Podría ser mejor",
    	"chi":"有待改善",
    	"hi":"बेहतर हो सकता था"
    },
    "You need more practice":{
    	"fr":"Vous avez besoin de plus de pratique",
    	"es":"Necesitas más practica",
    	"chi":"你需要更多练习",
    	"hi":"आपको अधिक अभ्यास की आवश्यकता है"
    },
    "You are below the passing grade":{
    	"fr":"Vous êtes en dessous de la note de passage",
    	"es":"Estás por debajo de la calificación aprobatoria",
    	"chi":"你低于及格分数",
    	"hi":"आप पासिंग ग्रेड से नीचे हैं"
    },
    "Congratulations! You just completed the game.":{
    	"fr":"Félicitations! Vous avez complété le jeu.",
    	"es":"¡Felicidades! Acabas de completar el juego.",
    	"chi":"恭喜！你刚刚完成了比赛。",
    	"hi":"बधाई हो\u0021 आपने बस खेल पूरा किया।"
    },
    "Oops! We were not able to serve your request.":{
    	"fr":"Oups! Nous n'avons pas pu exécuter votre requête.",
    	"es":"¡Uy! No pudimos atender su solicitud.",
    	"chi":"哎呀！我们无法满足您的要求。",
    	"hi":"ऊप्स\u0021 हम आपके अनुरोध की सेवा करने में सक्षम नहीं थे।"
    },
    "Did your math just bring you here? Let me help you. A black hole has been generated to break through time and space to redirect you to the home page.":{
    	"fr":"Est-ce vos mathématiques qui vous ont amenées ici? Laissez-moi vous aider. Un trou noir vient d'être généré pour briser le temps et l'espace pour vous rediriger vers la page principale.",
    	"es":"¿Tus matemáticas te trajeron aquí? Deja que te ayude. Se ha generado un agujero negro para atravesar el tiempo y el espacio para redirigirlo a la página de inicio.",
    	"chi":"你的数学只是把你带到这儿了吗？让我来帮助你。已生成黑洞以突破时间和空间以将您重定向到主页。",
    	"hi":"क्या आपका गणित आपको यहां तक ​​ले आया\u003f मुझे आपकी मदद करने दो। आपको होम पेज पर रीडायरेक्ट करने के लिए समय और स्थान के माध्यम से एक ब्लैक होल उत्पन्न हुआ है।"
    },
    "You will be redirected to the home page in %n seconds.":{
    	"fr":"Vous allez être redirigé vers la page principle dans %n secondes.",
    	"es":"Será redirigido a la página de inicio en %n segundos.",
    	"chi":"您将在%n秒内重定向到主页。",
    	"hi":"आपको %n सेकंड में होम पेज पर पुनः निर्देशित किया जाएगा।"
    },
    "Your browser does not support the video formats.":{
    	"fr":"Votre navigateur ne supporte pas les formats vidéos disponibles.",
    	"es":"Su navegador no soporta los formatos de video.",
    	"chi":"您的浏览器不支持视频格式。",
    	"hi":"आपका ब्राउज़र वीडियो प्रारूपों का समर्थन नहीं करता है।"
    },
    "Ideas for Progress":{
    	"fr": "Quelques idées pour progresser",
    	"es":"Ideas para progresar",
    	"chi":"进步的想法",
    	"hi":"प्रगति के लिए विचार"
    },
    "This page gives suggestions on what to do next to progress in the field of mathematics.":{
    	"fr": "Cette page donne des suggestions pour progresser dans le domaine des mathématiques.",
    	"es": "Esta página ofrece sugerencias sobre qué hacer al lado del progreso en el campo de las matemáticas.",
    	"chi":"该页面提供了有关数学领域的进展情况的建议。",
    	"hi":"यह पृष्ठ गणित के क्षेत्र में प्रगति के लिए आगे क्या करने के सुझाव देता है।"
    },
    "Magic Squares":{
    	"fr":"Carrés magiques",
    	"es":"Cuadrados mágicos",
    	"chi":"魔术广场",
    	"hi":"जादू वर्ग"
    },
    "Magic squares are squares filled with numbers in which the sum of any row, column, or diagonal is the same.":{
    	"fr": "Les carrés magiques sont des carrés remplis de chiffres qui vont donner la même somme sur toutes les rangées, colonnes, et principales diagonales.",
    	"es": "Los cuadrados mágicos son cuadrados rellenos con números en los que la suma de cualquier fila, columna o diagonal es la misma.",
    	"chi":"幻方是填充数字的正方形，其中任何行，列或对角线的总和是相同的。",
    	"hi":"मैजिक स्क्वेयर उन संख्याओं से भरे वर्ग होते हैं जिनमें किसी भी पंक्ति\u002c स्तंभ या विकर्ण का योग समान होता है।"
    },
    "Oops! Wrong answer. Look below for an explanation.":{
    	"fr":"Oups! Mauvaise réponse. Regardez ci-dessous pour une explication.",
    	"es":"¡Uy! Respuesta incorrecta. Busque a continuación una explicación.",
    	"chi":"哎呀！错误的答案。请看下面的解释。",
    	"hi":"ऊप्स\u0021 गलत जवाब। स्पष्टीकरण के लिए नीचे देखें।"
    },
    "Restart Addition Simulation":{
    	"fr":"Recommencer la simulation de l'addition",
    	"es":"Reiniciar simulación de adición",
    	"chi":"重新启动添加模拟",
    	"hi":"अतिरिक्त सिमुलेशन को पुनरारंभ करें"
    },
    "Restart Subtraction Simulation":{
    	"fr":"Recommencer la simulation de la soustraction",
    	"es":"Reiniciar simulación de sustracción",
    	"chi":"重新开始减法模拟",
    	"hi":"घटाव सिमुलेशन को पुनरारंभ करें"
    },
    "Restart Multiplication Simulation":{
    	"fr":"Recommencer la simulation de la multiplication",
    	"es":"Reiniciar la simulación de multiplicación",
    	"chi":"重新启动乘法模拟",
    	"hi":"गुणन सिमुलेशन को पुनरारंभ करें"
    },
    "Restart Division Simulation":{
    	"fr":"Recommencer la simulation de la division",
    	"es":"Reiniciar la simulación de división",
    	"chi":"重启分区模拟",
    	"hi":"विभाजन सिमुलेशन को पुनरारंभ करें"
    },
    
    
    "Next, sum the right most digits. The result gives %n. Put the result under the equal bar.":{
    	"fr":"Ensuite, additionnez les valeurs les plus à droites. Le résultat donne %n. Mettez ce résultat en dessous de la barre de résultats.",
    	"es":"Luego, suma los dígitos más a la derecha. El resultado da %n. Pon el resultado debajo de la barra igual.",
    	"chi":"接下来，将最右边的数字相加。结果给出%n。将结果置于相等的条形下。",
    	"hi":"अगला\u002c सही सबसे अधिक अंकों का योग। परिणाम %n देता है। परिणाम को बराबर बार के नीचे रखें।"
    },
    "Because the sum of the right most digits is greater than %n, we need to transfer the decade digit of the answer to the decade digits' column.":{
    	"fr":"Puisque la sum des valeurs les plus à droites est supérieur à %n, nous avons besoin de transférer le chiffre des dizaines de la réponse avec les autres chiffres des dizaines.",
    	"es":"Debido a que la suma de los dígitos más correctos es mayor que %n, necesitamos transferir el dígito de la década de la respuesta a la columna de los dígitos de la década.",
    	"chi":"由于最右边数字的总和大于%n，我们需要将答案的十进制数字转移到十进制数字列。",
    	"hi":"क्योंकि सही अधिकांश अंकों का योग %n से अधिक है\u002c इसलिए हमें उत्तर के दशक के अंक को दशक के अंक के कॉलम में स्थानांतरित करना होगा।"
    },
    "Now, we need to sum the decades of each number. Do not forget the extra decade value you added!":{
    	"fr":"Maintenant, nous avons besoin d'additionner les dizaines. N'oubliez pas d'inclure la dizaine additionelle!",
    	"es":"Ahora, necesitamos sumar las décadas de cada número. ¡No olvide el valor extra de la década que agregó!",
    	"chi":"现在，我们需要总结每个数字的数十年。不要忘记你添加的额外十年价值！",
    	"hi":"अब\u002c हमें प्रत्येक संख्या के दशकों का योग करने की आवश्यकता है। आपके द्वारा जोड़े गए अतिरिक्त दशक के मूल्य को मत भूलना\u0021"
    },
    "Finally, we have the answer of the equation under the equal bar.":{
    	"fr":"Finalement, nous avons la réponse en dessous de la barre de résultats.",
    	"es":"Finalmente, tenemos la respuesta de la ecuación debajo de la barra igual.",
    	"chi":"最后，我们在等条下得到了等式的答案。",
    	"hi":"अंत में\u002c हमारे पास बराबर बार के तहत समीकरण का उत्तर है।"
    },
    "Now, we need to sum the decades of each number.":{
    	"fr":"Maintenant, nous avons besoin d'additionner les dizaines de chaque chiffre.",
    	"es":"Ahora, necesitamos sumar las décadas de cada número.",
    	"chi":"现在，我们需要总结每个数字的数十年。",
    	"hi":"अब\u002c हमें प्रत्येक संख्या के दशकों का योग करने की आवश्यकता है।"
    },
    "Next, subtract the right most digits. The result gives %n.":{
    	"fr":"Ensuite, soustrayez les valeurs les plus à droites. Le résultat donne %n.",
    	"es":"A continuación, resta los dígitos más a la derecha. El resultado da %n.",
    	"chi":"接下来，减去最右边的数字。结果给出%n。",
    	"hi":"अगला\u002c सही अधिकांश अंकों को घटाएं। परिणाम %n देता है।"
    },
    "Because the subtraction of the right most digits gives a result lower than %n, we must borrow a unit from the higher position.":{
    	"fr":"Puisque la soustraction des valeurs les plus à droites donne un résultat inférieur à %n, nous devons emprunter une unité de la position supérieure.",
    	"es":"Debido a que la resta de los dígitos más a la derecha da un resultado menor que %n, debemos tomar prestada una unidad de la posición más alta.",
    	"chi":"因为最右边数字的减法给出的结果低于%n，所以我们必须从较高位置借一个单位。",
    	"hi":"क्योंकि सही अधिकांश अंकों का घटाव %n से कम परिणाम देता है\u002c हमें उच्च स्थिति से एक इकाई उधार लेनी चाहिए"
    },
    "Now, do the subtraction of the units by adding the value you took from the decades.":{
    	"fr":"Maintenant, faites la soustraction des unité en additionnant la valeur que vous avez prise des dizaines.",
    	"es":"Ahora, haz la resta de las unidades agregando el valor que tomaste de las décadas.",
    	"chi":"现在，通过添加您从几十年中获得的值来减去单位。",
    	"hi":"अब\u002c दशकों से आपके द्वारा लिए गए मूल्य को जोड़कर इकाइयों का घटाव करें।"
    },
    "Once we are done with the subtraction of the units, we do the subtraction of the decades. Below the equal bar is the answer.":{
    	"fr":"Maintenant que vous avez finis avec la soustraction des unités, faites la soustraction des dizaines. En dessous de la bar des résultats se trouve la réponse.",
    	"es":"Una vez que hemos terminado con la resta de las unidades, hacemos la resta de las décadas. Debajo de la barra igual está la respuesta.",
    	"chi":"一旦我们完成了单位的减法，我们就减去了几十年。等于条的下方就是答案。",
    	"hi":"एक बार जब हम इकाइयों के घटाव के साथ हो जाते हैं\u002c तो हम दशकों का घटाव करते हैं। बराबर पट्टी के नीचे उत्तर है।"
    },
    "We complete the operation by subtracting the decades unit together.":{
    	"fr":"Nous complétons l'opération en soustrayant les dizaines ensemble.",
    	"es":"Completamos la operación restando la unidad de décadas juntas.",
    	"chi":"我们通过将几十年的单位减去一起来完成操作。",
    	"hi":"हम एक साथ दशकों की यूनिट को घटाकर ऑपरेशन को पूरा करते हैं।"
    },
    "First, set the values to be vertically aligned.":{
    	"fr":"D'abord, alignez les chiffres verticalement.",
    	"es":"Primero, configure los valores para que estén alineados verticalmente.",
    	"chi":"首先，将值设置为垂直对齐。",
    	"hi":"सबसे पहले\u002c मानों को लंबवत रूप से संरेखित करने के लिए सेट करें।"
    },
    "We multiply the last digit of the first number by the last digit of the second number.":{
    	"fr":"Nous multiplions la dernière valeur du premier chiffre par la dernière valeur du deuxième chiffre.",
    	"es":"Multiplicamos el último dígito del primer número por el último dígito del segundo número.",
    	"chi":"我们将第一个数字的最后一位数乘以第二个数字的最后一位数。",
    	"hi":"हम पहली संख्या के अंतिम अंक को दूसरी संख्या के अंतिम अंक से गुणा करते हैं।"
    },
    "We need to do %n x %n. This gives us a result of %n. The answer is placed below the equal bar.":{
    	"fr":"Nous avons besoin de faire %n x %n. Le résultat est %n. La réponse est placée en dessous de la barre de résultats.",
    	"es":"Necesitamos hacer %n x %n. Esto nos da un resultado de %n. La respuesta se coloca debajo de la barra igual.",
    	"chi":"我们现在将第一个数字的最后一位乘以第二个数字的第一个数字。",
    	"hi":"हमें %n \u0078%n करने की आवश्यकता है। यह हमें %n का परिणाम देता है। उत्तर को बराबर बार के नीचे रखा गया है।"
    },
    "We now multiply the last digit of the first number by the first digit of the second number.":{
    	"fr":"Nous avons maintenant besoin de multiplier la dernière valeur du premier chiffre par la première valeur du deuxième chiffre.",
    	"es":"Ahora multiplicamos el último dígito del primer número por el primer dígito del segundo número.",
    	"chi":"我们现在将第一个数字的最后一位乘以第二个数字的第一个数字。",
    	"hi":"अब हम पहली संख्या के अंतिम अंक को दूसरी संख्या के पहले अंक से गुणा करते हैं।"
    },
    "We need to do %n x %n. This gives us a result of %n.":{
    	"fr":"Nous avons besoin de faire %n x %n. Cela donne un résultat de %n.",
    	"es":"Necesitamos hacer %n x %n. Esto nos da un resultado de %n.",
    	"chi":"我们需要做%n x%n。这给了我们%n的结果。",
    	"hi":"हमें %n \u0078%n करने की आवश्यकता है। यह हमें %n का परिणाम देता है।"
    },
    "However, because we are multiplicating by the decade unit of the second operand, we need to multiply our result by %n, and add that to our current result under the equal bar.":{
    	"fr":"Cependant, parce que nous sommes en train de multiplier avec l'unité des dizaines de la seconde opérande, nous avons besoin de multiplier le résultat par %n, et additionner ceci au résultat déjà présent en dessous de la barre des résultats.",
    	"es":"Sin embargo, debido a que estamos multiplicando por la unidad de la década del segundo operando, necesitamos multiplicar nuestro resultado por %n, y agregarlo a nuestro resultado actual debajo de la barra igual.",
    	"chi":"但是，因为我们乘以第二个操作数的十进制单位，我们需要将结果乘以%n，并将其添加到等值条下的当前结果。",
    	"hi":"हालाँकि\u002c क्योंकि हम दूसरे ऑपरेंड की दशक इकाई से गुणा कर रहे हैं\u002c हमें अपना परिणाम %n से गुणा करना होगा\u002c और बराबर बार के तहत अपने वर्तमान परिणाम में जोड़ना होगा।"
    },
    "Now, we have to do multiplications with the decade unit of the first operand. Our results thereon will be multiplied by %n because of that.":{
    	"fr":"Maintenant, nous devons faire les multiplications avec l'unité des dizaines de la première opérande. Nos résultats seront maintenant multipliés par %n pour cette raison.",
    	"es":"Ahora, tenemos que hacer multiplicaciones con la unidad de la década del primer operando. Nuestros resultados al respecto se multiplicarán por %n debido a eso.",
    	"chi":"现在，我们必须使用第一个操作数的十进制单位进行乘法运算。因此，我们的结果将乘以%n。",
    	"hi":"अब\u002c हमें पहले ऑपरेंड की दशक इकाई के साथ गुणा करना होगा। हमारे परिणाम उसके कारण %n से कई गुना अधिक होंगे।"
    },
    "We now multiply the first digit of the first operand with the last digit of the second operand.":{
    	"fr":"Nous multiplions maintenant la première valeur de la première opérande avec la dernière valeur de la seconde opérande.",
    	"es":"Ahora multiplicamos el primer dígito del primer operando con el último dígito del segundo operando.",
    	"chi":"我们现在将第一个操作数的第一个数字与第二个操作数的最后一个数字相乘。",
    	"hi":"अब हम पहले ऑपरेंड के पहले अंक को दूसरे ऑपरेंड के अंतिम अंक से गुणा करते हैं।"
    },
    "We need to do %n x %n. This gives us a result of %n. We multiply that answer by %n and put it under the equal bar.":{
    	"fr":"Nous devons faire %n x %n. Cela nous donne le résultat %n. Nous multiplions cette réponse par %n et nous la plaçons sous la barre de résultats.",
    	"es":"Necesitamos hacer %n x %n. Esto nos da un resultado de %n. Multiplicamos esa respuesta por %n y la colocamos bajo la barra igual.",
    	"chi":"我们需要做%n x%n。这给了我们%n的结果。我们将该答案乘以%n并将其置于相等的条形下。",
    	"hi":"हमें %n \u0078%n करने की आवश्यकता है। यह हमें %n का परिणाम देता है। हम उस उत्तर को %n से गुणा करते हैं और बराबर बार के नीचे रखते हैं।"
    },
    "We need to do %n x %n. This gives us a result of %n. We multiply that answer by %n*%n because we are using the decade unit of the first operand and the second operand.":{
    	"fr":"Nous devons faire %n x %n. Cela nous donne le résultat %n. Nous multiplions cette réponse par %n*%n parce que nous utilisons l'unité des dizaines de la première et seconde opérande.",
    	"es":"Necesitamos hacer %n x %n. Esto nos da un resultado de %n. Multiplicamos esa respuesta por %n * %n porque estamos usando la unidad de la década del primer operando y el segundo operando.",
    	"chi":"我们需要做%n x%n。这给了我们%n的结果。我们将该答案乘以%n *%n，因为我们使用第一个操作数和第二个操作数的十进制单位。",
    	"hi":"हमें %n \u0078%n करने की आवश्यकता है। यह हमें %n का परिणाम देता है। हम उस उत्तर को %n \u002a%n से गुणा करते हैं क्योंकि हम पहले ऑपरेंड के दशक की यूनिट और दूसरे ऑपरेंड का उपयोग कर रहे हैं।"
    },
    "We now have our second value under the equal bar. Now we must do the addition.":{
    	"fr":"Nous avons notre seconde valeur en dessous de la barre de résultats. Nous devons maintenant effectuer l'addition.",
    	"es":"Ahora tenemos nuestro segundo valor debajo de la barra igual. Ahora debemos hacer la adición.",
    	"chi":"我们现在在平等条件下获得第二个值。现在我们必须做补充。",
    	"hi":"अब हमारे पास बराबर बार के तहत हमारा दूसरा मूल्य है। अब हमें इसके अतिरिक्त करना चाहिए।"
    },
    "Remember that multiplications by %n gives %n. That is why we are not stepping through the decade unit multiplication of the first operand. We now have the answer under the equal bar.":{
    	"fr":"N'oubliez pas que les multiplications par %n donnent %n. C'est pourquoi la simulation ne montre pas la multiplication avec l'unité des dizaines de la première opérande. Nous avons maintenant la réponse en dessous de la barre de résultats.",
    	"es":"Recuerde que las multiplicaciones por %n dan %n. Es por eso que no estamos pasando por la multiplicación de unidades de la década del primer operando. Ahora tenemos la respuesta debajo de la barra igual.",
    	"chi":"请记住，%n的乘法给出%n。这就是为什么我们没有踩过第一个操作数的十进制单位乘法。我们现在在同等条件下得到答案。",
    	"hi":"याद रखें कि %n से गुणन %n देता है। यही कारण है कि हम पहले ऑपरेंड के दशक इकाई गुणन के माध्यम से कदम नहीं बढ़ा रहे हैं। अब हमारे पास बराबर पट्टी के तहत जवाब है।"
    },
    "First, set the values as shown below.":{
    	"fr":"D'abord, placez les valeurs comme montré ci-dessous.",
    	"es":"Primero, establezca los valores como se muestra a continuación.",
    	"chi":"首先，设置如下所示的值。",
    	"hi":"सबसे पहले\u002c नीचे दिखाए अनुसार मान सेट करें।"
    },
    "Then, look at how many times the dividend goes into the divisor. To do that, we look into each digit of the dividend individually.":{
    	"fr":"Ensuite, observez combien de fois que le dividende rentre dans le diviseur. Pour faire cela, nous regardons chaque valeur du dividende individuellement.",
    	"es":"Luego, mira cuántas veces el dividendo va al divisor. Para hacer eso, examinamos cada dígito del dividendo individualmente.",
    	"chi":"然后，看看股息进入除数的次数。为此，我们分别查看股息的每个数字。",
    	"hi":"फिर\u002c यह देखें कि लाभांश कितनी बार विभाजक में जाता है। ऐसा करने के लिए\u002c हम व्यक्तिगत रूप से लाभांश के प्रत्येक अंक को देखते हैं।"
    },
    "How much times do %n go into %n? It goes %n times, because %n is the closest lower value in multiples of %n to %n.":{
    	"fr":"Combien de fois %n rentre dans %n? La réponse est %n, parce que %n est la valeur la plus proche. Si on fait les multiples de %n, on réalise que c'est la valeur la plus proche de %n.",
    	"es":"¿Cuántas veces entra %n en %n? Va %n veces, porque %n es el valor inferior más cercano en múltiplos de %n a %n.",
    	"chi":"%n进入%n的次数是多少？它会转换%n次，因为%n是%n到%n的倍数中最接近的较低值。",
    	"hi":"%n कितनी बार %n में जाता है\u003f यह %n बार जाता है\u002c क्योंकि %n\u002c %n से %n के गुणक में निकटतम निचला मान है"
    },
    "Then, the answer can be found above the dividend. (%n)":{
    	"fr": "Puis, la ré est placée au dessus du dividende. (%n)",
    	"es":"Entonces, la respuesta se puede encontrar por encima del dividendo. (%n)",
    	"chi":"然后，可以在红利之上找到答案。 （%n）",
    	"hi":"फिर\u002c उत्तर लाभांश से ऊपर पाया जा सकता है। \u0028%n\u0029"
    },
    "Because %n divided by %n gives %n, we need to bring down the next digit.":{
    	"fr":"Puisque %n divisé par %n donne %n, nous devons descendre la prochaine valeur.",
    	"es":"Debido a que %n dividido por %n da %n, debemos bajar el siguiente dígito.",
    	"chi":"因为%n除以%n给出%n，我们需要降低下一个数字。",
    	"hi":"क्योंकि %n द्वारा विभाजित %n\u002c %n देता है\u002c हमें अगला अंक नीचे लाने की आवश्यकता है"
    },
    "Then, bring down the unit digit of the dividend.":{
    	"fr":"Ensuite, descendez l'unité du dividende.",
    	"es":"Luego, baja el dígito unitario del dividendo.",
    	"chi":"然后，降低被除数的单位数。",
    	"hi":"फिर\u002c लाभांश की इकाई अंक को नीचे लाएं।"
    },
    "Because the hundred digit is smaller than the divisor, pull down the decade value.":{
    	"fr":"Puisque l'unité des centaines est plus petite que le diviseur, descendez l'unité des dizaines.",
    	"es":"Debido a que los cien dígitos son más pequeños que el divisor, baje el valor de la década.",
    	"chi":"因为百位数小于除数，所以下拉十进制值。",
    	"hi":"क्योंकि सौ अंक भाजक से छोटा होता है\u002c दशक मान को नीचे खींचते हैं।"
    },
    "Because %n divided by %n gives a result lower than %n, then we need to bring down the next digit.":{
    	"fr":"Puisque %n divisé par %n donne un résultat plus petit que %n, nous devons descendre la prochaine valeur.",
    	"es":"Debido a que %n dividido por %n da un resultado menor que %n, entonces necesitamos bajar el siguiente dígito.",
    	"chi":"因为%n除以%n得到的结果低于%n，所以我们需要降低下一个数字。",
    	"hi":"क्योंकि %n द्वारा विभाजित %n परिणाम %n से कम देता है\u002c तो हमें अगला अंक नीचे लाने की आवश्यकता है।"
    },
    
    "This page gives some information about me.":{
    	"fr":"Cette page donne de l'information sur moi.",
    	"es":"Esta página da alguna información sobre mí.",
    	"chi":"这个页面提供了一些关于我的信息.",
    	"hi":"यह पृष्ठ मेरे बारे में कुछ जानकारी देता है।"
    },
    "My name is Alexandre Therrien, and I am the creator of this web site. This web site has been a learning experience for me as this is the first web site I have put online. I am an avid learner and I have always wanted to learn something new. I have done numerous projects in the past to gain experience in different computer science fields. If you want to know more about me, you can look at my profile on LinkedIn: https://ca.linkedin.com/in/alexandre-therrien-it. If you want to contact me, you can do so by emailing me at alexandre.therrien%n@gmail.com. Hope you are enjoying this web site!":{
    	"fr":"Mon nom est Alexandre Therrien, et je suis le créateur de ce site web. La création de ce site web fut une expérience d'apprentissage pour moi, puisque ceci est le premier site web que j'ai mis en ligne. J'adore apprendre et j'ai toujours voulu apprendre quelque chose de nouveau. J'ai fait de nombreux projets dans le passé pour gagner de l'expérience dans divers sujets de l'informatique. Si vous voulez en savoir plus sur moi, vous pouvez regarder mon profil sur LinkedIn: https://ca.linkedin.com/in/alexandre-therrien-it. Si vous voulez me contactez, vous pouvez le faire en m'envoyant un email à alexandre.therrien3@gmail.com. J'espère que vous appréciez ce site.",
    	"es":"Me llamo Alexandre Therrien, y soy el creador de este sitio web. Este sitio web ha sido una experiencia de aprendizaje para mí, ya que este es el primer sitio web que he puesto en línea. Soy un ávido aprendiz y siempre he querido aprender algo nuevo. He realizado numerosos proyectos en el pasado para adquirir experiencia en diferentes campos de la informática. Si quieres saber más sobre mí, puedes ver mi perfil en LinkedIn: https://ca.linkedin.com/in/alexandre-therrien-it. Si quiere contactarme, puede hacerlo enviándome un correo electrónico a alexandre.therrien3@gmail.com. Espero que estés disfrutando de este sitio web!",
    	"chi":"我的名字是Alexandre Therrien,我是这个网站的创建者。这个网站对我来说是一次学习经历，因为这是我在网上发布的第一个网站。我是一个狂热的学习者，我一直想学习新的东西。我过去做了很多项目，以获得不同计算机科学领域的经验。如果您想了解更多关于我的信息，可以查看我的个人资料LinkedIn: https://ca.linkedin.com/in/alexandre-therrien-it.如果您想与我联系，您可以通过电子邮件与我联系alexandre.therrien3@gmail.com. 希望你喜欢这个网站!",
    	"hi":"मेरा नाम हैAlexandre Therrien, और मैं इस वेब साइट का निर्माता हूं। यह वेब साइट मेरे लिए एक सीखने का अनुभव रहा है क्योंकि यह पहली वेब साइट है जिसे मैंने ऑनलाइन रखा है। मैं एक शौकीन व्यक्ति हूं और मैं हमेशा कुछ नया सीखना चाहता हूं। मैंने विभिन्न कंप्यूटर विज्ञान क्षेत्रों में अनुभव हासिल करने के लिए अतीत में कई परियोजनाएं की हैं। यदि आप मेरे बारे में अधिक जानना चाहते हैं\u002c तो आप मेरी प्रोफ़ाइल को देख सकते हैं LinkedIn: https://ca.linkedin.com/in/alexandre-therrien-it. यदि आप मुझसे संपर्क करना चाहते हैं\u002c तो आप मुझे ईमेल करके ऐसा कर सकते हैं alexandre.therrien3@gmail.com. आशा है कि आप इस वेब साइट का आनंद ले रहे होंगे!"
    },
    
    "Welcome to Math Rush":{
    	"fr": "Bienvenue sur Ruée de mathématiques",
    	"es":"Bienvenido a Carrera de matemáticas",
    	"chi":"欢迎来到Math Rush",
    	"hi":"मैथ रश में आपका स्वागत है"
    },
    "Choose your Math":{
    	"fr": "Choisissez vos mathématiques",
    	"es":"Elige tus matemáticas",
    	"chi":"选择你的数学",
    	"hi":"अपना मठ चुनें"
    },
    "Game Completed":{
    	"fr": "Partie complétée",
    	"es":"Juego completado",
    	"chi":"游戏完成了",
    	"hi":"खेल पूरा हुआ"
    }
    
}